---
kind: property
id: P:Autodesk.Revit.DB.SunAndShadowSettings.NumberOfFrames
source: html/5c820dcf-f2dc-5d96-edc7-31c0ce7b94f9.htm
---
# Autodesk.Revit.DB.SunAndShadowSettings.NumberOfFrames Property

Identifies the total number of animation frames for a single-day or multi-day study.

## Syntax (C#)
```csharp
public double NumberOfFrames { get; }
```